# ElementsNotAllowedAreNotAddedToAssembly Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..ElementsNotAllowedAreNotAddedToAssembly Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
Elements not allowed in Assembly were not added to it, but only in the document
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementsNotAllowedAreNotAddedToAssembly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementsNotAllowedAreNotAddedToAssembly As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementsNotAllowedAreNotAddedToAssembly {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace